import streamlit as st
st.set_page_config(
    page_title="Tanakorn's Portfolio",
    page_icon="👋",
)

st.title("ยินดีต้อนรับครับ")
st.subheader("รวมผลงาน Web Application (Prototype)")
st.sidebar.success("☝️ เลือกโปรเจคจากเมนูด้านบนได้เลยครับ")

st.markdown(
    """
    ผม **ป้อ ธนกร รอดด้วยธรรม (Tanakorn Roddouytam) นิสิตชั้นปีที่ 4 คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย** 
    ได้รวบรวมโปรเจคการใช้ AI และ Machine Learning สำหรับแก้ปัญหาในโรงงานไว้ 2 ส่วนครับ:
    
    ---
    
    ### 1. Defect Inspection
    * ใช้ AI (Machine Learning) มาช่วยวิเคราะห์สถานการณ์ของสินค้าที่กำลังผ่านการ processing ในเครื่องจักร 
    เพื่อตรวจสอบว่ามีโอกาสเกิด defect หรือไม่, พร้อมแนะนำและแจ้งเตือนว่าหากมีโอกาสเกิดควรทำอย่างไรต่อ
    
    ### 2. Smart Claim Tracking
    * ทำระบบตรวจสอบสถานะของสินค้าที่ต้องการส่งมาแจ้งปัญหาหลังการขายพร้อมแจ้งความคืบหน้าในแต่ละ process 
    รวมถึงคำนวณเวลาโดยประมาณของแต่ละ case ที่ส่งมาแจ้งปัญหา
    """
)

#import os

#st.divider()
#st.subheader("🕵️ จารวิสขอนับไฟล์หน่อยครับ")

# 1. เช็กว่าตอนนี้เราอยู่ที่โฟลเดอร์ไหน
#current_path = os.getcwd()
#st.write(f"📂 โฟลเดอร์ปัจจุบัน: `{current_path}`")

# 2. เช็กว่ามีโฟลเดอร์ pages หรือยัง
#files = os.listdir(current_path)
#if "pages" in files:
#    st.success("✅ เจอโฟลเดอร์ 'pages' แล้วครับ!")
    
    # 3. เช็กของข้างใน
#    pages_files = os.listdir(os.path.join(current_path, "pages"))
#    st.write(f"📄 ไฟล์ใน pages: {pages_files}")
    
#    if len(pages_files) == 0:
#        st.error("❌ แต่ในโฟลเดอร์ pages ไม่มีไฟล์อยู่เลยครับ!")
#    else:
#        st.info("ลองเช็กชื่อไฟล์ดูว่าลงท้ายด้วย .py ไหมนะครับ")
#else:
#    st.error(f"❌ ไม่เจอโฟลเดอร์ 'pages' ครับ (เจอแต่: {files})")
#    st.warning("⚠️ เจ้านายอาจจะสร้างโฟลเดอร์ผิดที่ หรือตั้งชื่อผิด (ต้องเป็น 'pages' ตัวเล็กหมดครับ)")"""
